//
// Définition de l'hypercube
//

#include "hypercube.hh"

namespace Hypercube
{
  GLfloat vertices[] =
    {
      -1, -1, -1, -1,
      -1, -1, -1,  1,
      -1, -1,  1, -1,
      -1, -1,  1,  1,
      -1,  1, -1, -1,
      -1,  1, -1,  1,
      -1,  1,  1, -1,
      -1,  1,  1,  1,
       1, -1, -1, -1,
       1, -1, -1,  1,
       1, -1,  1, -1,
       1, -1,  1,  1,
       1,  1, -1, -1,
       1,  1, -1,  1,
       1,  1,  1, -1,
       1,  1,  1,  1
  };

  GLubyte colors[] =
    {
      //R,   G,   B,   A
        0,   0,   0, 255,
        0,   0, 255, 255,
        0, 255,   0, 255,
        0, 255, 255, 255,
      255,   0,   0, 255,
      255,   0, 255, 255,
      255, 255,   0, 255,
      255, 255, 255, 255,
        0,   0,   0,   0,
        0,   0, 255,   0,
        0, 255,   0,   0,
        0, 255, 255,   0,
      255,   0,   0,   0,
      255,   0, 255,   0,
      255, 255,   0,   0,
      255, 255, 255,   0
    };

  const unsigned int number_of_vertex = 32;

  // FIXME : il faut un tableau d'indices pour indiquer les faces
}
